async function answer({ inlineQuery, answerInlineQuery }) {
    let results = []
    let text = inlineQuery.query.split(' ')
    text.shift() // remove first element
    text = text.join(' ')

    function pushResult(title, result) {
        results.push({ type: 'article', id: `Aa_${title}`, title: title, description: result, input_message_content: { message_text: result } })
    }
    pushResult("25% 轉換", transformLetter(text, 0.25))
    pushResult("100% 通通轉換", transformLetter(text, 1))
    pushResult("大小寫互換", text.split('').map(a => a.toUpperCase() == a ? a.toLowerCase() : a.toUpperCase()).join(''))
    pushResult("大小寫互換 + 50% 蹦蹦轉換", transformLetter(text.split('').map(a => a.toUpperCase() == a ? a.toLowerCase() : a.toUpperCase()).join(''), .5))

    console.log(`[${'@' + inlineQuery.from.username || inlineQuery.from.first_name}][letter][${text}] 處理完畢`, results)
    return answerInlineQuery(results, { cache_time: 60 * 60 /* second */ })
}
function transformLetter(text, randomRate = 1) {
    let result = ''
    text = text.split('')
    let letterList = {
        A: ["Á", "À", "Ă", "Ắ", "Ằ", "Ẵ", "Ẳ", "Â", "Ấ", "Ầ", "Ẫ", "Ẩ", "Ǎ", "Å", "Ǻ", "Ä", "Ǟ", "Ã", "Ȧ", "Ǡ", "Ą", "Ā", "Ả", "Ȁ", "Ȃ", "Ạ", "Ặ", "Ậ", "Ḁ", "Ⱥ"],
        a: ["á", "à", "ă", "ắ", "ằ", "ẵ", "ẳ", "â", "ấ", "ầ", "ẫ", "ẩ", "ǎ", "å", "ǻ", "ä", "ǟ", "ã", "ȧ", "ǡ", "ą", "ā", "ả", "ȁ", "ȃ", "ạ", "ặ", "ậ", "ḁ", "ⱥ"],
        B: ["Ḃ", "Ḅ", "Ḇ", "Ƀ", "Ɓ"],
        b: ["ḃ", "ḅ", "ḇ", "ƀ", "ᵬ", "Ƃ", "ᵬ", "ᶀ"],
        C: ["Ć", "Ĉ", "Č", "Ċ", "Ç", "Ḉ", "Ȼ", "Ƈ"],
        c: ["ć", "ĉ", "č", "ċ", "ç", "ḉ", "ȼ", "ƈ"],
        D: ["Ď", "Ḋ", "Ḑ", "Ḍ", "Ḓ", "Ḏ", "Đ", "Ɖ", "Ɗ"],
        d: ["ď", "ḋ", "ḑ", "ḍ", "ḓ", "ḏ", "đ", "ɖ", "ɗ"],
        E: ["É", "È", "Ĕ", "Ê", "Ế", "Ề", "Ễ", "Ể", "Ě", "Ë", "Ẽ", "Ė", "Ȩ", "Ḝ", "Ę", "Ē", "Ḗ", "Ḕ", "Ẻ", "Ȅ", "Ȇ", "Ẹ", "Ệ", "Ḙ", "Ḛ", "Ɇ"],
        e: ["é", "è", "ĕ", "ê", "ế", "ề", "ễ", "ể", "ě", "ë", "ẽ", "ė", "ȩ", "ḝ", "ę", "ē", "ḗ", "ḕ", "ẻ", "ȅ", "ȇ", "ẹ", "ệ", "ḙ", "ḛ", "ɇ"],
        F: ["Ḟ", "Ƒ"],
        f: ["ḟ", "ƒ", "ᵮ", "ᶂ"],
        G: ["Ǵ", "Ğ", "Ĝ", "Ǧ", "Ġ", "Ģ", "Ḡ", "Ǥ"],
        g: ["ǵ", "ğ", "ĝ", "ǧ", "ġ", "ģ", "ḡ", "ǥ"],
        H: ["Ĥ", "Ȟ", "Ḧ", "Ḣ", "Ḩ", "Ḥ", "Ḫ", "H", "Ħ", "Ⱨ"],
        h: ["ĥ", "ȟ", "ḧ", "ḣ", "ḩ", "ḥ", "ḫ", "ẖ", "ħ", "ⱨ"],
        I: ["Í", "Ì", "Ĭ", "Î", "Ǐ", "Ï", "Ḯ", "Ĩ", "İ", "Į", "Ī", "Ỉ", "Ȉ", "Ȋ", "Ị", "Ḭ", "I", "Ɨ"],
        i: ["í", "ì", "ĭ", "î", "ǐ", "ï", "ḯ", "ĩ", "i", "į", "ī", "ỉ", "ȉ", "ȋ", "ị", "ḭ", "ı", "ɨ"],
        J: ["Ĵ", "Ɉ"],
        j: ["ĵ", "ɉ"],
        K: ["Ḱ", "Ǩ", "Ķ", "Ḳ", "Ḵ", "Ⱪ"],
        k: ["ḱ", "ǩ", "ķ", "ḳ", "ḵ", "Ƙ", "ⱪ"],
        L: ["Ĺ", "Ľ", "Ļ", "Ḷ", "Ḹ", "Ḽ", "Ḻ", "Ł", "Ŀ", "Ƚ", "Ⱡ", "Ɫ"],
        l: ["ĺ", "ľ", "ļ", "ḷ", "ḹ", "ḽ", "ḻ", "ł", "ŀ", "ƚ", "ⱡ", "ɫ"],
        M: ["Ḿ", "Ṁ", "Ṃ", "M"],
        m: ["ḿ", "ṁ", "ṃ"],
        N: ["Ń", "Ǹ", "Ň", "Ñ", "Ṅ", "Ņ", "Ṇ", "Ṋ", "Ṉ"],
        n: ["ń", "ǹ", "ň", "ñ", "ṅ", "ņ", "ṇ", "ṋ", "ṉ"],
        O: ["Ó", "Ò", "Ŏ", "Ô", "Ố", "Ồ", "Ỗ", "Ổ", "Ǒ", "Ö", "Ȫ", "Ő", "Õ", "Ṍ", "Ṏ", "Ȭ", "Ȯ", "Ȱ", "Ø", "Ǿ", "Ǫ", "Ǭ", "Ō", "Ṓ", "Ṑ", "Ỏ", "Ȍ", "Ȏ", "Ơ", "Ớ", "Ờ", "Ỡ", "Ở", "Ợ", "Ọ", "Ộ", "Ɵ"],
        o: ["ó", "ò", "ŏ", "ô", "ố", "ồ", "ỗ", "ổ", "ǒ", "ö", "ȫ", "ő", "õ", "ṍ", "ṏ", "ȭ", "ȯ", "ȱ", "ø", "ǿ", "ǫ", "ǭ", "ō", "ṓ", "ṑ", "ỏ", "ȍ", "ȏ", "ơ", "ớ", "ờ", "ỡ", "ở", "ợ", "ọ", "ộ", "ɵ"],
        P: ["Ṕ", "Ṗ", "Ᵽ", "Ƥ"],
        p: ["ṕ", "ṗ", "ᵽ", "ƥ"],
        Q: ["Ɋ"],
        q: ["ɋ"],
        R: ["Ŕ", "Ř", "Ṙ", "Ŗ", "Ȑ", "Ȓ", "Ṛ", "Ṝ", "Ṟ", "Ɍ"],
        r: ["ŕ", "ř", "ṙ", "ŗ", "ȑ", "ȓ", "ṛ", "ṝ", "ṟ", "ɍ"],
        S: ["Ś", "Ṥ", "Ŝ", "Š", "Ṧ", "Ṡ", "Ş", "Ṣ", "Ṩ", "Ș", "$"],
        s: ["ś", "ṥ", "ŝ", "š", "ṧ", "ṡ", "ş", "ṣ", "ṩ", "ș"],
        T: ["Ť", "T", "Ṫ", "Ţ", "Ṭ", "Ț", "Ṱ", "Ṯ", "Ŧ", "Ⱦ"],
        t: ["ť", "ẗ", "ṫ", "ţ", "ṭ", "ț", "ṱ", "ṯ", "ŧ", "ⱦ"],
        U: ["Ú", "Ù", "Ŭ", "Û", "Ǔ", "Ů", "Ü", "Ǘ", "Ǜ", "Ǚ", "Ǖ", "Ű", "Ũ", "Ṹ", "Ų", "Ū", "Ṻ", "Ủ", "Ȕ", "Ȗ", "Ư", "Ứ", "Ừ", "Ữ", "Ử", "Ự", "Ụ", "Ṳ", "Ṷ", "Ṵ", "Ʉ"],
        u: ["ú", "ù", "ŭ", "û", "ǔ", "ů", "ü", "ǘ", "ǜ", "ǚ", "ǖ", "ű", "ũ", "ṹ", "ų", "ū", "ṻ", "ủ", "ȕ", "ȗ", "ư", "ứ", "ừ", "ữ", "ử", "ự", "ụ", "ṳ", "ṷ", "ṵ", "ʉ"],
        V: ["Ṽ", "Ṿ"],
        v: ["ṽ", "ṿ"],
        W: ["Ẃ", "Ẁ", "Ŵ", "Ẅ", "Ẇ"],
        w: ["ẃ", "ẁ", "ŵ", "ẘ", "ẅ", "ẇ", "ẉ"],
        X: ["Ẍ", "Ẋ"],
        x: ["ẍ", "ẋ"],
        Y: ["Ý", "Ỳ", "Ŷ", "Y", "Ÿ", "Ỹ", "Ẏ", "Ȳ", "Ỷ", "Ỵ"],
        y: ["ẙ", "ÿ", "ỹ", "ẏ", "ȳ", "ỷ", "ỵ", "ý", "ỳ", "ŷ"],
        Z: ["Ź", "Ẑ", "Ž", "Ż", "Ẓ", "Ẕ", "Ƶ"],
        z: ["ź", "ẑ", "ž", "ż", "ẓ", "ẕ", "ƶ"]
    }
    function chooseRandomElementFromArray(arr) {
        return arr[Math.floor(Math.random() * arr.length)]
    }
    for (let letter of text) {
        if (Object.keys(letterList).includes(letter) && randomRate >= Math.random()) {
            result += chooseRandomElementFromArray(letterList[letter])
        } else {
            result += letter
        }
    }
    return result
}

module.exports = answer